#Даны три целых числа, одно из которых отлично от двух других, равных между собой. Определить порядковый номер числа, отличного от остальных
while True:
    try:
        a = int(input("Введите A: "))
        b = int(input("Введите B: "))
        c = int(input("Введите C: "))
        break
    except ValueError:
        print("Нужно ввести цифрами")

if a != b and a != c:
    print("Отличное число: A (первое)")
elif b != a and b != c:
    print("Отличное число: B (второе)")
else:
    print("Отличное число: C (третье)")

